//# Навигация между страницами
// На данный момент созданное нами приложение Next.js имеет только одну страницу. Веб-сайты и веб-приложения обычно состоят из множества разных страниц.

// Давайте рассмотрим, как добавить больше страниц в наше приложение.

//# Что вы узнаете на этом уроке
/*
На этом уроке вы:
- Создайте новую страницу, используя интегрированную маршрутизацию файловой системы.
- Узнайте, как использовать этот компонент Link для обеспечения навигации между страницами на стороне клиента.
- Узнайте о встроенной поддержке разделения кода и предварительной выборки.
*/

// Если вам нужна подробная документация по маршрутизации Next.js, ознакомьтесь с документацией по маршрутизации.
