//# Введение
// Добро пожаловать в документацию Next.js!

//# Что такое Next.js?
// Next.js — это платформа React для создания полнофункциональных веб-приложений. Вы используете компоненты React для создания пользовательских интерфейсов и Next.js для дополнительных функций и оптимизации.

// Под капотом Next.js также абстрагирует и автоматически настраивает инструменты, необходимые для React, такие как объединение, компиляция и многое другое. Это позволяет вам сосредоточиться на создании приложения, а не тратить время на настройку.

// Независимо от того, являетесь ли вы индивидуальным разработчиком или частью более крупной команды, Next.js поможет вам создавать интерактивные, динамичные и быстрые приложения React.

//# Основные характеристики
// Маршрутизация - Маршрутизатор на основе файловой системы, построенный на основе серверных компонентов, который поддерживает макеты, вложенную маршрутизацию, состояния загрузки, обработку ошибок и многое другое.

// Рендеринг - Клиентский и серверный рендеринг с использованием клиентских и серверных компонентов. Дальнейшая оптимизация с помощью статического и динамического рендеринга на сервере с помощью Next.js. Потоковая передача в среде выполнения Edge и Node.js.

// Получение данных - Упрощенная выборка данных с помощью async/await в серверных компонентах и ​​расширенный fetchAPI для запоминания запросов, кэширования и повторной проверки данных.

// Стиль - Поддержка предпочитаемых вами методов стилизации, включая модули CSS, Tailwind CSS и CSS-in-JS.

// Оптимизации - Оптимизация изображений, шрифтов и скриптов для улучшения основных веб-показателей и пользовательского опыта вашего приложения.

// Машинопись - Улучшенная поддержка TypeScript с улучшенной проверкой типов и более эффективной компиляцией, а также специальным плагином TypeScript и средством проверки типов.

//# Как использовать эти документы
// В левой части экрана вы найдете панель навигации «Документы». Страницы документации организованы последовательно, от базового до расширенного, поэтому вы можете следовать им шаг за шагом при создании приложения. Однако вы можете читать их в любом порядке или переходить к страницам, которые подходят для вашего варианта использования.

// В правой части экрана вы увидите оглавление, которое упрощает навигацию между разделами страницы. Если вам нужно быстро найти страницу, вы можете использовать строку поиска вверху или ярлык поиска (Ctrl+K или Cmd+K).

// Для начала ознакомьтесь с руководством по установке.

//# Маршрутизатор приложений против маршрутизатора страниц
// В Next.js есть два разных маршрутизатора: маршрутизатор приложений и маршрутизатор страниц. App Router — это новый маршрутизатор, который позволяет использовать новейшие функции React, такие как серверные компоненты и потоковую передачу. Маршрутизатор страниц — это оригинальный маршрутизатор Next.js, который позволял создавать приложения React, отображаемые на сервере, и продолжает поддерживаться для более старых приложений Next.js.

// В верхней части боковой панели вы увидите раскрывающееся меню, которое позволяет переключаться между функциями App Router и Pages Router. Поскольку существуют функции, уникальные для каждого каталога, важно отслеживать, какая вкладка выбрана.

// Хлебные крошки в верхней части страницы также будут указывать, просматриваете ли вы документы App Router или документы Pages Router.

//# Предварительные знания
// Хотя наша документация предназначена для новичков, нам необходимо установить базовый уровень, чтобы документация могла сосредоточиться на функциональности Next.js. Мы обязательно предоставим ссылки на соответствующую документацию всякий раз, когда представим новую концепцию.

// Чтобы получить максимальную отдачу от нашей документации, рекомендуется иметь базовые знания HTML, CSS и React. Если вам нужно освежить свои навыки React, посетите наш курс Next.js Foundations Course, который познакомит вас с основами.

//# Доступность
// Для оптимальной доступности при использовании программы чтения с экрана во время чтения документов мы рекомендуем использовать Firefox и NVDA или Safari и VoiceOver.

//# Присоединяйтесь к нашему сообществу
// Если у вас есть вопросы по поводу Next.js, вы всегда можете задать их нашему сообществу в обсуждениях GitHub, Раздор, Твиттер и Реддит.
