//# Группы маршрутов
// В каталоге app вложенные папки обычно сопоставляются с URL-путями. Однако вы можете пометить папку как группу маршрутов, чтобы предотвратить включение этой папки в URL-адрес маршрута.

// Это позволяет вам организовывать сегменты маршрутов и файлы проектов в логические группы, не затрагивая структуру URL-путей.

/*
Группы маршрутов полезны для:
- Организация маршрутов в группы, например. по разделу сайта, намерению или команде.
- Включение вложенных макетов на одном уровне сегмента маршрута:
  - Создание нескольких вложенных макетов в одном сегменте, включая несколько корневых макетов.
  - Добавление макета к подмножеству маршрутов в общем сегменте
*/

//# Соглашение
// Группу маршрутов можно создать, заключив имя папки в круглые скобки: (folderName)

//# Примеры

