//# Операторы сравнения (возвращают true или false)
/*
При сравнении значений разных типов JavaScript приводит каждое из них к числу.
Строгое равенство - проверяет равенство без приведения типов (т.е. разные типы не равны).

1) >   (больше)
2) <   (меньше)
3) >=  (больше или равно)
4) <=  (меньше или равно)
5) ==  (нестрогое равенство)
6) !=  (нестрогое неравенство)
7) === (строгое равенство)
8) !== (строгое неравенство)

Специальное правило:
(null == undefined) // true
(Эти значения равны друг другу и не равны никаким другим значениям)
*/
