//# Основное содержание страницы, которое не повторяется на других страницах
//* <main>
/*
- Блок, в котором расположен самый основной и важный контент страницы, чтобы поисковик индексировал его с повышенным приоритетом.
- В документе не должно быть больше одного main, у которого нет атрибута hidden.
- В main помещают главное содержимое - то, которое больше нигде не повторяется на сайте.
- Соответственно, второстепенные элементы сюда не входят: шапка сайта, подвал, боковые панели, ссылки навигации, информация об авторских правах, логотипы сайта и поисковые формы, как правило, остаются вне контейнера main.
- Единственный случай, когда поисковую форму стоит положить в main - это когда она является главным элементом на странице, например, на странице поиска.
*/

//# Шапка всего сайта или какой-то части контента
//* <header>
/*
- Шапка всего сайта или какой-то части контента, например, статьи, блок с вводной информацией (логотип, строка поиска, меню, кнопки соцсетей или другие ключевые элементы).
- На странице может быть несколько header.
- Но их нельзя помещать в footer, address или другой header.
*/

//# Подвал сайта или какой-то части контента
//* <footer>
/*
- Подвал сайта (контакты, ссылки на разделы сайта, копирайт, название компании, правовая информацию, ссылки на соцсети).
- Может быть не только у всего сайта целиком, но и у отдельного блока или секции.
- Нельзя вкладывать в address, header или другой footer.
- Контакты и информацию об авторе стоит поместить в контейнер address, а его добавить в footer.
*/