//* evt.view
// Возвращает объект window, в котором произошло событие.

//* evt.key
// Хранит название нажатой клавиши

//* evt.keyCode (устарел)
// Хранит уникальный код нажатой клавиши

//* evt.pageX и evt.pageY
// Координаты по горизонтали и вертикали от угла веб-страницы хранятся в свойствах event.pageX и event.pageY соответственно. Пользоваться этими свойствами удобно, например, когда вы создаёте всплывающую подсказку около элемента, по которому кликнул пользователь.

//* evt.clientX и evt.clientY
// Координаты относительно угла окна просмотра хранятся в свойствах event.clientX и event.clientY. Это подойдёт для позиционирования окна чата со специалистом, которое можно встретить на многих сайтах.

//* evt.screenX и evt.screenY
// Свойства event.screenX и event.screenY хранят координаты относительно угла монитора, на котором открыт сайт. Они используются крайне редко.
