//# Атрибут accept-charset (КОДИРОВКА ФОРМЫ)
// Задаёт кодировку, в которой сервер принимает данные из формы. Самая распространённая кодировка — UTF-8.

//# Пример
<form accept-charset="UTF-8"></form>;

//# Значения
//* accept-charset="UNKNOWN" (по умолчанию)
// Кодировка будет такой, какая используется на странице с формой.

//* accept-charset="UTF-8"
// Самая распространённая кодировка — UTF-8.

//* accept-charset="UTF-8 Windows-1251"
// Можно указать несколько вариантов. В этом случае названия кодировок нужно разделять пробелами.
