//# Ресурсы, метаданные и CSS
// Вторая добавленная страница в настоящее время не имеет стиля. Давайте добавим немного CSS для стилизации страницы.

// Next.js имеет встроенную поддержку CSS и Sass. В этом курсе мы будем использовать CSS.

// В этом уроке также будет рассказано о том, как Next.js обрабатывает статические ресурсы, такие как изображения, и метаданные страницы, такие как тег <title>.

//# Что вы узнаете на этом уроке
/*
В этом уроке вы узнаете:
- Как добавить статические файлы (изображения и т. д.) в Next.js.
- Как настроить содержимое <head> каждой страницы.
- Как создать повторно используемый компонент React, стилизованный с использованием модулей CSS.
- Как добавить глобальный CSS в pages/_app.js.
- Несколько полезных советов по стилизации в Next.js.
*/

//# Предварительные условия
// Базовые знания CSS. В этом курсе будет рассмотрено, как добавить CSS в приложение Next.js, но не будут рассмотрены основы CSS.

// Если вам нужна подробная документация по стилизации Next.js, взгляните на документацию CSS.
