//# Атрибут rel
/*
- Определяет отношение между страницей, где находится ссылка, и страницей или файлом, куда она ведёт.
- Обычно это очень техническая информация, которая нужна браузерам и разработчикам, чтобы определять, что находится по ссылке, и, в некоторых случаях, какое действие нужно выполнить сайту, который открывается по ссылке.
*/

//# Значения
//* rel="noopener noreferrer"
<a rel="noopener noreferrer" target="_self"></a>;
// Используйте rel="noopener noreferrer", чтобы в момент открытия внешние сайты не узнали лишнего про текущую страницу.
