// # bgsound (ФОНОВАЯ МУЗЫКА) (background sound: фоновая музыка)
// Для автоматического воспроизведения музыкального файла. В отличие от современного использования встраивания аудио-контента с помощью <embed> или <audio>, не отображает на странице кнопок управления (стоп, пауза, громкость). Такая бесконтрольность допускала злоупотребление этим эффектом. Поддержка тега была реализована только в Internet Explorer.

//# Пример
<bgsound src="sound2.mid" loop="infinite" />;

//# Чем заменить
// Тег <audio>.
