//# операторы присваивания
/*
1) =	 (оператор присваивания)
2) +=	 (оператор присваивания со сложением)
3) -=	 (оператор присваивания с вычитанием)
4) *=  (оператор присваивания с умножением)
5) /=  (оператор присваивания с делением)
6) &&= (оператор присваивания с логическим И (присваивает значение переменной только если оно true)
7) ||= (оператор присваивания с логическим ИЛИ (присваивает значение переменной только если оно false)
8) ??= (оператор присваивания c нулевым слиянием (присваивает значение переменной только если оно null или undefined)
*/