//# приоритет операторов
/*
https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Operator_Precedence

19  (VALUE) (скобки)
16  VALUE++ (постфиксный инкремент) (увеличивает переменную на 1, аналогично value = value + 1, возвращает старое значение)
16  VALUE-- (постфиксный декремент) (уменьшает переменную на 1, аналогично value = value - 1, возвращает старое значение)
15  ++VALUE (префиксный инкремент)  (увеличивает переменную на 1, аналогично value + 1 = value, возвращает новое значение)
15  --VALUE (префиксный декремент)  (уменьшает переменную на 1, аналогично value - 1 = value, возвращает новое значение)
15	+VALUE  (унарный плюс) (преобразует нечисловые значения в число)
15	-VALUE  (унарный минус)	(меняет знак числа на противоположный)
15  !VALUE  (логическое НЕ)
14	**      (возведение в степень)
13	*       (умножение)
13	/       (деление)
13  %       (остаток от деления)
12	+       (сложение)
12	-       (вычитание)
5   &&      (логическое И)
4   ||      (логическое ИЛИ)
4   ??      (оператор нулевого слияния) (используется для присвоения переменным значений по умолчанию)
2	  +=      (присваивание со сложением)
2	  -=      (присваивание с вычитанием)
2	  =       (присваивание)
1   ,       (запятая) (предоставляет возможность вычислять несколько выражений, но возвращается результат только последнего)
*/
