//# Reference error (ошибка ссылки)
// Возникает, если обратиться к необъявленной переменной или вызвать несуществующую функцию

//! ReferenceError: numdberFnc is not defined (англ. «Функция numdberFnc не объявлена»)

//# Syntax Error (синтаксическая ошибка)
// Означает, что был нарушен синтаксис языка. Обычно такие ошибки вызваны тем, что пропущена скобка или точка с запятой поставлена в неположенном месте.

//! Uncaught SyntaxError: Unexpected token ) (англ. «Неожиданная скобка»)
//! Uncaught SyntaxError: Unexpected token else (англ. «Неожиданный ключ else»)

//# Ошибка типизации: Type Error (ошибка типа)
// Возникает, когда переменная используется не по назначению. Например, мы записали в неё строку, но пытаемся вызвать эту переменную как функцию.

//! Uncaught TypeError: hut is not a function (англ. «Переменная hut не является функцией»)
