//# Описание пользовательского интерфейса
// React — это библиотека JavaScript для рендеринга пользовательских интерфейсов (UI). Пользовательский интерфейс состоит из небольших элементов, таких как кнопки, текст и изображения. React позволяет объединять их в многоразовые вложенные компоненты. От веб-сайтов до приложений для телефона — все на экране можно разбить на компоненты. В этой главе вы научитесь создавать, настраивать и условно отображать компоненты React.

/* В этой главе
- Как написать свой первый компонент React.
- Когда и как создавать многокомпонентные файлы.
- Как добавить разметку в JavaScript с помощью JSX.
- Как использовать фигурные скобки с JSX для доступа к функциям JavaScript из ваших компонентов.
- Как настраивать компоненты с помощью реквизитов.
- Как создавать условия.
- Как визуализировать несколько компонентов одновременно.
- Как избежать ошибок, сохраняя компоненты чистыми.
- Почему полезно понимать ваш пользовательский интерфейс в виде деревьев.
*/

//# Ваш первый компонент
