//# Рендеринг списков
// Часто требуется отобразить несколько одинаковых компонентов из набора данных. Для работы с массивом данных можно использовать методы JavaScript array methods. На этой странице вы будете использовать filter() и map() в React для фильтрации и преобразования массива данных в массив компонентов.

/* Вы узнаете
- Как выводить компоненты из массива с помощью JavaScript map().
- Как отобразить только определенные компоненты с помощью JavaScript filter().
- Когда и зачем использовать ключи React
*/

