//# Поддержание чистоты компонентов
// Некоторые функции JavaScript являются чистыми. Чистые функции выполняют только вычисления и ничего более. Если вы будете писать свои компоненты только как чистые функции, вы сможете избежать целого класса непонятных ошибок и непредсказуемого поведения по мере роста вашей кодовой базы. Однако, чтобы получить эти преимущества, необходимо следовать нескольким правилам.

/* Вы узнаете
- Что такое чистота и как она помогает избежать ошибок
- Как сохранить чистоту компонентов, не допуская изменений на этапе рендеринга
- Как использовать режим Strict Mode для поиска ошибок в ваших компонентах
*/

//# Чистота: Компоненты как формулы
