//# details (details) (подробности)
/*
- Блок с раскрывающимся контентом на чистом HTML.
- У <details> есть групповая роль group.
- Иногда нужно скрывать какую-то информацию на странице в специальном блоке. Чтобы в любой момент можно было кликнуть на этот блок и развернуть информацию. И свернуть обратно таким же кликом. Такой блок ещё называют «аккордеоном».
- Тег <details> — это интерактивный элемент, при нажатии на который открывается блок с информацией — текстом или картинками. Нередко такие элементы можно встретить на страницах с часто задаваемыми вопросами (FAQ), где в заголовке (или легенде) написан вопрос, а ответом является содержимое «аккордеона».
- 
*/

//# Пример
<details>
  <summary>Легенда</summary>
  <p>Раскрывающийся текст</p>
</details>;
