//# Как работает Next.js
// Прежде чем изучать более продвинутые функции Next.js, было бы полезно понять основы работы Next.js.

// В начале этого курса мы говорили о том, что React относительно непредвзято относится к тому, как вы создаете и структурируете свои приложения — существует множество способов создания приложений с помощью React. Next.js предоставляет основу для структурирования вашего приложения и оптимизации, которые помогают ускорить как процесс разработки, так и окончательное приложение.

/*
В следующих разделах мы рассмотрим, что происходит с кодом вашего приложения на этих различных этапах:
- Среда, в которой работает ваш код: разработка и производство
- Когда ваш код выполняется: время сборки и время выполнения
- Где происходит рендеринг: клиент или сервер
*/

// Теперь давайте углубимся в эти концепции и обсудим некоторые процессы, которые Next.js выполняет за кулисами.
