//# git commit (СДЕЛАТЬ КОММИТ)
/*
- Создать коммит проиндексированного состояния кода.
- Откроет текстовый редактор с предложением ввести комментарий к коммиту.
*/

//* git commit
// Синтаксис.

//* git commit -m "text"
// Быстрое создание коммита с указанным комментарием. При передаче ключа -m (message) текстовый редактор не открывается.

//* git commit --amend
//* i (vim)
//* поменять текст (vim)
//* shift + ZZ (vim)
/*
- Изменить последний коммит, проиндексированные изменения будут добавлены в предыдущий коммит.
- Откроет текстовый редактор с предложением изменить указанный ранее комментарий к коммиту.
- Предыдущий коммит не останется в текущей ветке.
*/
