//# git add (ДОБАВИТЬ ИЗМЕНЕНИЯ В ИНДЕКС STAGE)
/*
- Команда git add — это первая команда в цепочке операций, предписывающей Git «сохранить» снимок текущего состояния проекта в истории коммитов.
- Когда git add используется как отдельная команда, она переносит ожидающие изменения из рабочего каталога в раздел проиндексированных файлов.
*/

//* git add имя_папки
// Синтаксис.

//* git add имя_файла
// Синтаксис.

//* git add --all
//* git add -A
//* git add .
// Добавить все изменения для индексирования
