//# i (italic) (курсив)
/*
- Тег <i> используется для изменения голоса или настроения части текста, чтобы передать его другое качество: официальное название, идиома из другого языка, транслитерация или ремарки.
- Для выделения важного используется <strong>, для изменения тона — <em>.
- По умолчанию браузеры применяют к <i> курсивное начертание с помощью font-style: italic.
- В более ранних версиях спецификации HTML элемент <i> был просто презентационным элементом, который использовался для отображения текста курсивом. Теперь тег определяет семантику, а не типографское оформление.
- Тег <i> поддерживает глобальные атрибуты и события.

- Элемент <i> используется только в том случае, если не существует более подходящего семантического элемента, например:
<em> — смысловое ударение в предложении;
<strong> — повышенная важность;
<mark> — выделение «маркером»;
<dfn> — термин или расшифровка сокращения.
*/

//# Пример
<p>
  Кабанов <i>(вздыхая в сторону)</i>. Ах ты, господи!
  <i>(Матери.)</i> Да смеем ли мы, маменька, подумать!
</p>;
