//# Присваивание
// Присваивание также возвращает значение.
//*2	 =              (присваивание)
//*2	 +=             (присваивание с сложением)
//*2	 -=             (присваивание с вычитанием)
//*2	 *=             (присваивание с умножением)
//*2	 /=             (присваивание с делением)
//*2	 **=            (присваивание с возведением в степень)
//*2   value &&= 10   (присваивание с логическим И - присваивает значение только если value true)
//*2   value ||= 10   (присваивание с логическим ИЛИ - присваивает значение только если value false)
//*2   value ??= 10   (присваивание c нулевым слиянием - присваивает значение только если value null/undefined)

//# Запятая
//*1   ,      (запятая - предоставляет возможность вычислять несколько выражений, возвращает результат последнего)
