//# функции
// При написании функции указываются параметры — те переменные, с которыми работает функция. При вызове функции можно передать в нее аргументы. Если функцию передают как аргумент, её называют «колбэком».

//# общая информация
/*
- Основное отличие в том, что если мы использовали Function Declaration, то JavaScript перенесёт функции вверх текущей области видимости. Это называется «поднятие» (или hoisting).
- На практике это означает, что мы можем использовать Function Declaration до своего же объявления. Пишем — заработай, и где-то потом объясняем как.
- Обычно имя функции пишут стилем camelCase и используют в начале глагол. Отвечает на вопрос: что делает эта функция?.
- Переменные внутри функции существуют только внутри этой функции — этот эффект называется областью видимости.
- Функции в JavaScript — это значения, такие же как числа или строки.
*/
