//# Element
// Элемент — это кусочек HTML в DOM-дереве. Браузер создаёт DOM для взаимодействия между JavaScript и HTML. Каждый HTML-тег при этом превращается в элемент DOM. Ещё такие элементы называют узлами.

//# общая информация
/* Из DOM можно получить элемент и изменить его. Браузер заметит изменения и отобразит их на странице.
- HTML-элементы содержат свойства, которые можно разделить на группы:
1) свойства, связанные с HTML-атрибутами: id, классы, стили и так далее
2) свойства и методы связанные с обходом DOM: получение дочерних элементов, родителя, соседей
3) информация о содержимом
4) специфические свойства элемента
- Первые три группы свойств есть у всех элементов. Специфические свойства отличаются в зависимости от типа элемента. Например, у полей ввода есть свойства, которых нет у параграфов и блоков: value, type и другие.*/
