//# Создайте приложение Next.js
/*
Чтобы создать полноценное веб-приложение с помощью React с нуля, необходимо учитывать множество важных деталей:
- Код необходимо упаковать с помощью бандлера, такого как webpack, и преобразовать с помощью компилятора, такого как Babel.
- Вам необходимо провести оптимизацию производства, например разделение кода.
- Возможно, вы захотите статически предварительно отрендерить некоторые страницы для повышения производительности и SEO. Вы также можете использовать рендеринг на стороне сервера или рендеринг на стороне клиента.
- Возможно, вам придется написать серверный код, чтобы подключить приложение React к хранилищу данных.
*/

// Фреймворк может решить эти проблемы. Но такой фреймворк должен иметь правильный уровень абстракции — иначе он будет бесполезен. Он также должен иметь большой «Опыт разработчика», гарантирующий, что вы и ваша команда получите потрясающий опыт при написании кода.

//# Next.js: React Framework
// React Framework. Next.js предоставляет решение всех вышеперечисленных проблем. Но что еще более важно, это приведет вас и вашу команду к успеху при создании приложений React.

/*
Next.js стремится предоставить лучший в своем классе опыт разработки и множество встроенных функций, таких как:
- Интуитивно понятная система маршрутизации на основе страниц (с поддержкой динамических маршрутов)
- Предварительный рендеринг: статическая генерация (SSG) и рендеринг на стороне сервера (SSR) поддерживаются для каждой страницы
- Автоматическое разделение кода для более быстрой загрузки страниц
- Маршрутизация на стороне клиента с оптимизированной предварительной выборкой
- Встроенная поддержка CSS и Sass, а также поддержка любой библиотеки CSS-in-JS
- Среда разработки с поддержкой Fast Refresh
- Маршруты API для создания конечных точек API с помощью бессерверных функций
- Полностью расширяемый
*/

// Next.js используется в десятках тысяч производственных веб-сайтов и веб-приложений, включая многие крупнейшие мировые бренды.

//# Об этом руководстве
// Этот бесплатный интерактивный курс расскажет вам, как начать работу с Next.js.

/* В этом уроке вы изучите основы Next.js, создав очень простое приложение для блога. Вот пример конечного результата:
https://next-learn-starter.vercel.app/

В этом руководстве предполагается базовое знание JavaScript и React. Если вы никогда не писали код React, сначала вам следует пройти официальное руководство по React.

Если вместо этого вам нужна документация, посетите документацию Next.js.
*/

//# Присоединиться к разговору
// Если у вас есть вопросы о чем-либо, связанном с Next.js или этим курсом, вы можете задать их нашему сообществу на Discord.

// Давайте начнем!
