//# Редактирование страницы
/*
Давайте попробуем отредактировать стартовую страницу.
- Убедитесь, что сервер разработки Next.js все еще работает.
- Откройте pages/index.js с помощью текстового редактора.
- Найдите под тегом <h1> текст «Добро пожаловать в» и измените его на «Изучить».
- Сохраните файл.
*/

// Как только вы сохраните файл, браузер автоматически обновит страницу новым текстом.

// На сервере разработки Next.js включено быстрое обновление. Когда вы вносите изменения в файлы, Next.js практически мгновенно автоматически применяет изменения в браузере. Обновление не требуется! Это поможет вам быстро работать над вашим приложением.

// Далее: Создание страниц

// Отличная работа! Вот и все для первого урока.

// На следующем уроке мы поговорим о создании дополнительных страниц и навигации между страницами.

// Вам следует оставить сервер разработки работающим, но если вы хотите перезапустить его, нажмите Ctrl + c, чтобы остановить сервер.
