//# abbr (abbreviation) (аббревиатура) -->
/*
- Тег <abbr> используется для вывода аббревиатур или акронимов.
- <abbr> можно использовать вместе с <dfn> для более формального описания определения.
*/

//# пример
<p>
  <abbr title="Организация объединённых наций">ООН</abbr>— международная организация, созданная для поддержания и
  укрепления международного мира и безопасности, а также развития сотрудничества между государствами.
</p>;

<p>
  <dfn>
    Организация объединённых наций (<abbr title="Организация объединённых наций">ООН</abbr>) — международная
    организация, созданная для поддержания и укрепления международного мира и безопасности, а также развития
    сотрудничества между государствами
  </dfn>
</p>;
