//# Управление состоянием
// По мере роста приложения необходимо более тщательно подходить к организации состояния и потоков данных между компонентами. Избыточное или дублирующееся состояние является распространенным источником ошибок. В этой главе вы узнаете, как правильно структурировать состояние, как поддерживать логику обновления состояния и как обмениваться состоянием между удаленными компонентами.

/* В этом разделе
- Как рассматривать изменения пользовательского интерфейса как изменения состояния
- Как правильно структурировать состояние
- Как "поднять состояние вверх", чтобы поделиться им между компонентами
- Как контролировать сохранение или сброс состояния
- Как объединить сложную логику состояния в функции
- Как передавать информацию без "бурения пропсов"
- Как масштабировать управление состояниями по мере роста вашего приложения
*/
