//# mark (mark) (пометка)
/*
- Тег <mark> выделяет или подсвечивает важный фрагмент текста. По умолчанию браузеры добавляют <mark> жёлтый фоновый цвет #ffff00 (yellow), похожий на выделение канцелярским маркером.
- В обычном тексте с помощью <mark> можно выделить что-то связанное с текущей активностью пользователя, например, найденные слова во время поиска по тексту.
- В цитатах <mark> помогает подсветить то, на что автор основного текста хочет обратить внимание.
- Можно реализовать текстовый поиск, выделяя цветом найденные фрагменты.
- У <mark> есть встроенная роль mark. Хотя скринридеры не рассказывают про роль пользователям и не выделяют содержимое с помощью изменения интонации, она добавляет тегу семантический вес и потенциал с точки зрения доступности.
*/

//# Пример
<p>
  Мы можем предложить вам на выбор преимущественно <mark>чёрных</mark>,<mark>белых</mark> или <mark>серых</mark>
  котов. Также обратите внимание на <mark>черепаховую</mark> кошку, которую сложно определить в одну из этих категорий.
</p>;
