//# От JavaScript к React

//# Рендеринг пользовательских интерфейсов
// Чтобы понять, как работает React, нам сначала нужно иметь базовое представление о том, как браузеры интерпретируют ваш код для создания интерактивных пользовательских интерфейсов (UI).

// Когда пользователь посещает веб-страницу, сервер возвращает браузеру HTML-файл. Затем браузер считывает HTML и создает объектную модель документа (DOM).

//# Что такое DOM
// DOM — это объектное представление элементов HTML. Он действует как мост между вашим кодом и пользовательским интерфейсом и имеет древовидную структуру с родительскими и дочерними отношениями.

// Вы можете использовать методы DOM и язык программирования, например JavaScript, для прослушивания пользовательских событий и манипулирования DOM , выбирая, добавляя, обновляя и удаляя определенные элементы в пользовательском интерфейсе. Манипуляции с DOM позволяют не только ориентироваться на определенные элементы, но и изменять их стиль и содержимое.

// Давайте посмотрим, как вы можете использовать методы JavaScript и DOM, в следующем разделе.



