//# Рендеринг списков
// Часто вам потребуется отобразить несколько похожих компонентов из коллекции данных. Вы можете использовать методы массива JavaScript для управления массивом данных. На этой странице вы будете использовать filter() и map() с React для фильтрации и преобразования массива данных в массив компонентов.

/*
Ты выучишь
- Как визуализировать компоненты из массива с помощью метода map JavaScript ()
- Как визуализировать только определенные компоненты, используя метод filter JavaScript()
- Когда и зачем использовать ключи React
*/

