//# Поддержание чистоты компонентов
// Некоторые функции JavaScript являются чистыми. Чистые функции выполняют только вычисления и не более того. Строго записывая свои компоненты только как чистые функции, вы можете избежать целого класса непонятных ошибок и непредсказуемого поведения по мере роста вашей кодовой базы. Однако, чтобы получить эти преимущества, необходимо соблюдать несколько правил.

/* Ты выучишь
- Что такое чистота и как она помогает избежать ошибок
- Как сохранить чистоту компонентов, не допуская внесения изменений на этапе рендеринга
- Как использовать строгий режим для поиска ошибок в компонентах
*/

