//# small (small) (маленький)
/*
- Тег <small> используется для вывода текста мелким шрифтом. Обычно его используют для пояснений или небольших комментариев.
- По умолчанию браузеры задают размеру текста в теге <small> значение smaller.
- Часто маленьким шрифтом выводятся различные правовые формулировки, текст которых должен обязательно присутствовать на странице. Но зачастую мы хотим сделать их поменьше, чтобы они не занимали много места и не отвлекали на себя внимание.
- <small> следует использовать для небольших пояснений или комментариев, которые дополняют или раскрывают предшествующий текст. Он не подойдёт, если нам нужно:
- Убрать интонационное выделение, создаваемое тегами <em> или <strong>. Если нужно показать, что какой-то отрывок текста не важен, то его просто не нужно оборачивать в <em> или <strong>.
- Добавить подзаголовок. Для этого стоит использовать теги заголовков соответствующего уровня.
- Вывести длинный отрывок текста маленьким шрифтом, например, пользовательское соглашение. Для этих целей блок с пользовательским соглашением лучше стилизовать отдельно.

- Для чего <small> подойдёт идеально:
1. пояснения;
2. комментарии;
3. дисклеймеры;
4. предостережения;
5. копирайт;
6. информация о лицензии;
7. прочая правовая информация.
*/

//# Пример
<p>
  JavaScript — это лучший язык программирования в мире!
  <br />
  <small>Но это не точно.</small>
</p>;

<>
  <div class="coupon">
    <h3>Акция!</h3>
    <p>Предъявите усы, лапы или хвост и получите скидку до 30% на услуги почтовых отправлений.</p>
  </div>
  <small>Не является публичной офертой. Копирайт © 2021 ОАО «Печкин и партнёры». Все права сохранены.</small>
</>;


