//# class (ЗАДАЕТ КЛАСС) (class: класс)
/*
- Позволяет выбирать конкретный элемент (или несколько) при помощи CSS или JavaScript. В качестве значения для атрибута class задают один или несколько классов для HTML-элемента, разделённые пробелом.

- При выборе имени класса следует придерживаться нескольких правил:
1. В именах классов используй только английские слова.
2. Имена классов пишутся маленькими буквами.
3. Для разделения двух слов используются тире (-) или знак подчёркивания (_). Не используй camelCase.
4. Лучше не использовать больше трёх слов в имени класса.
5. Не используй в названиях классов цифры или числительные. Завтра порядок блоков может измениться и нумерация будет сбивать с толку.
6. Не задавайте имя класса по контенту или по тегу. Контент — вещь живая. Если он изменится, то класс потеряет свою актуальность, что осложнит чтение и понимание кода. Теги также могут измениться в процессе жизни сайта.
7. Не опирайтесь на внешний вид элемента при выборе имени класса. В разработке есть тенденция к быстрым изменениям. Поэтому завтра внешний вид сайта может полностью измениться. При подборе имён классов по смыслу элемента позволит избежать изменения HTML-разметки.
8. Не используйте пробел для разделения слов внутри одного имени класса.
*/

//# Пример
<div class="text">Простой div</div>;
