//# class (ЗАДАЕТ КЛАСС ЭЛЕМЕНТА)
/*
- Позволяет выбирать конкретный элемент (или несколько) при помощи CSS или JavaScript.
- В качестве значения для атрибута class задают один или несколько классов для HTML-элемента, разделённые пробелом.
- В именах классов используй только английские слова.
- Имена классов пишутся маленькими буквами.
- Для разделения двух слов используются тире (-) или знак подчёркивания (_). Не используй camelCase.
- Лучше не использовать больше трёх слов в имени класса.
- Не используй в названиях классов цифры или числительные. Завтра порядок блоков может измениться и нумерация будет сбивать с толку.
- Не задавайте имя класса по контенту или по тегу. Контент — вещь живая. Если он изменится, то класс потеряет свою актуальность, что осложнит чтение и понимание кода. Теги также могут измениться в процессе жизни сайта.
- Не опирайтесь на внешний вид элемента при выборе имени класса. В разработке есть тенденция к быстрым изменениям. Поэтому завтра внешний вид сайта может полностью измениться. При подборе имён классов по смыслу элемента позволит избежать изменения HTML-разметки.
- Не используйте пробел для разделения слов внутри одного имени класса.
*/

//# Пример
<div class="parent">Простой div</div>;
