//# data (ПОЛЬЗОВАТЕЛЬСКИЙ АТРИБУТ)
// Дата-атрибут — это пользовательский атрибут на HTML-элементе, название которого начинается с data-. Это встроенная возможность стандарта HTML5. В дата-атрибутах можно хранить дополнительную информацию в стандартных HTML-элементах и работать с этой информацией в JavaScript при помощи собственного API.

//# Пример
<div data-size="small" class="attribute-div" title="attribute"></div>;

//# Значения
// После "data-" можно написать любое подходящее по смыслу слово.

//* data-size="small"
// Атрибут size с значением "small"

//* data-small
// Атрибут small без значения.

//* data-long-size-atribute="small"
// Атрибут - длинное имя из нескольких слов с значением "small". Слова разделяются тире.
