//# spellcheck (ПРОВЕРКА ПРАВОПИСАНИЯ ЭЛЕМЕНТА)
// С помощью этого атрибута мы указываем браузеру, что в элементе, которому он задан, нужно проверить правописание.

//# Пример
<textarea spellcheck="default"></textarea>;

//# Значения
//* spellcheck="default"
// Указывает на поведение по умолчанию. При этом значении поле ввода может наследовать значение аналогичного атрибута от родительских элементов.

//* spellcheck="true"
// Проверка правописания включена

//* spellcheck="true"
// Проверка правописания выключена
