//# Атрибут cite (cite) (цитировать)
// Атрибут используется для указания источников цитат, названий художественных произведений или объектов искусства. Указывается именно источник цитаты, а не её автор.

//# blockquote
<blockquote cite="http://www.vothouse.ru/points/citaty-steve-jobs/">
  <p>
    Ваша работа заполнит большую часть жизни и единственный способ быть полностью довольным — делать то, что по-вашему
    является великим делом. И единственный способ делать великие дела — любить то, что вы делаете.
  </p>
</blockquote>;

//# q
<p>
  Великая актриса Фаина Раневская часто говорила:
  <q cite="https://www.soyuz.ru/articles/889">
    Жизнь слишком коротка, чтобы тратить её на диеты, жадных мужчин и плохое настроение.
  </q>
</p>;
