//# Что такое бандлинг?
// Разработчики разбивают свое приложение на модули, компоненты и функции, которые можно использовать для создания более крупных частей своего приложения. Экспорт и импорт этих внутренних модулей, а также внешних сторонних пакетов создает сложную сеть зависимостей файлов.

// Объединение — это процесс разрешения сети зависимостей и объединения (или «упаковки») файлов (или модулей) в оптимизированные для браузера пакеты с целью уменьшения количества запросов файлов при посещении пользователем веб-страницы.
