//# Атрибут autofocus (ФОКУС ПРИ ЗАГРУЗКЕ)
/*
- Атрибут булевого типа (без значения, либо атрибут есть в теге, либо его нет совсем). Если он указан, то при загрузке страницы фокус будет автоматически помещён в данное поле ввода.
- Пользователю не нужно специально нажимать на этот элемент, чтобы начать в нём что-то писать.
- В фокусе может быть только один элемент на странице, но это не может быть элемент типа hidden.

- Может применяться к следующим элементам формы:
1. <button>
2. <select>
3. <textarea>
4. <input>
*/

//# Пример
<textarea autofocus></textarea>;
