//# getDate() (ДЕНЬ МЕСЯЦА 1-31)
// Возвращает день месяца.

//# Синтаксис
//* без переменной
new Date().getDate();

//* с переменной
const currentDate = new Date();
currentDate.getDate();

//# Возвращает
//* Число - день месяца.

//# setDate() (УСТАНАВЛИВАЕТ ДЕНЬ МЕСЯЦА 1-31)
// Устанавливает день месяца.

//# Синтаксис
setDate(dayValue);
//* Число: dayValue - день месяца.

//# Возвращает
//* Число - количество миллисекунд от начала эпохи (1 января 1970 00:00:00 UTC) для полученного значения объекта.
