//# CSS - стили
// Давайте теперь поговорим о стилях CSS.

// Как видите, наша индексная страница (http://localhost:3000) уже имеет несколько стилей. Если вы посмотрите на свою файловую структуру, вы увидите папку styles с двумя файлами CSS: глобальной таблицей стилей (globals.css) и модулем CSS (Home.module.css).

//# CSS-модули
// Модули CSS позволяют локально определять область действия CSS на уровне компонентов, автоматически создавая уникальные имена классов. Это позволяет вам использовать одно и то же имя класса CSS в разных файлах, не беспокоясь о конфликтах имен классов.

/* Помимо модулей CSS, вы можете стилизовать свое приложение Next.js различными способами, в том числе:
- Sass, который позволяет импортировать .css файлы .scss.
- Библиотеки PostCSS, такие как Tailwind CSS.
- Библиотеки CSS-in-JS, такие как styled-jsx , styled-Components и Emotion.
*/

// В этом уроке мы поговорим о том, как использовать модули CSS и Sass в Next.js. Давайте погрузимся!
