//# Незначительные правки, такие как обновление цены
//* <s>
// чаще всего «потеря актуальности» отображается в меню или прейскурантах при смене цены.

//# Значимые правки в тексте, которые важно зафиксировать
//* <del> и <ins>

//# Информация, которую пользователь может получить в процессе взаимодействия с программой
//* <samp>
/*
- вывод информации о ходе выполнения программы
- ошибки, предупреждения и подсказки инструментов разработчика или операционной системы
- приглашение к вводу данных
*/

//# Результат работы программы в реальном времени
//* <output>
/*
- информация, которую пользователь вводит или изменяет в форме
- вывод расчётов по данным, которые указал пользователь (калькулятор, гороскоп и т. п.)
*/

//# Пояснения или небольшие комментарии, которые дополняют или раскрывают предшествующий текст
//* <small>
/*
- различные правовые формулировки, текст которых должен обязательно присутствовать на странице
- пояснения
- комментарии
- дисклеймеры
- предостережения
- копирайт
- информация о лицензии
- прочая правовая информация
*/

//# Убрать интонационное выделение, создаваемое тегами <em> или <strong>
// Если нужно показать, что какой-то отрывок текста не важен, то его просто не нужно оборачивать в <em> или <strong>.

//# Пользовательское соглашение
// блок с пользовательским соглашением лучше стилизовать отдельно.

//# Выделение автора материала
//* <address>

//# Выделение текста жёлтым маркером
//* <mark>

//# Высокая важность
//* <strong>
// добавляет важности обёрнутому в него тексту. Может использоваться для выделения предупреждений или части документа, которую пользователь должен увидеть раньше остального. При этом обозначение части текста тегом <strong> не должно изменять смысла предложения.

//# Дата и время
//* <time>
