//# незначительные правки, такие как обновление цены
//* <s>
// Чаще всего «потеря актуальности» отображается в меню или прейскурантах при смене цены.

//# значимые правки в тексте, которые важно зафиксировать
//* <del> и <ins>

//# информация, которую пользователь может получить в процессе взаимодействия с программой
//* <samp>
/*
- вывод информации о ходе выполнения программы
- ошибки, предупреждения и подсказки инструментов разработчика или операционной системы
- приглашение к вводу данных
*/

//# результат работы программы в реальном времени
//* <output>
/*
- информация, которую пользователь вводит или изменяет в форме;
- вывод расчётов по данным, которые указал пользователь (калькулятор, гороскоп и т. п.).
*/
