//# Атрибут lang
/*
- В HTML есть атрибут lang, который подсказывает браузеру язык, на котором написан текст на странице. Если добавить lang в <html>, браузер правильно отобразит текст и подберёт подходящую для этого языка пунктуацию. Например, в английском тексте будут такие кавычки “ ”, а в русском такие «».
- Кроме того, атрибут lang позволяет браузеру понять, отличается ли язык страницы от языка вашей системы. Если да, то браузер предложит пользователю использовать онлайн-переводчик.
*/

//# Пример
// <!DOCTYPE html>
<html lang="ru">
  <head>
    <title>Название документа</title>
  </head>
  <body>Содержимое страницы.</body>
</html>;
