//# Начало работы с Redux Toolkit

//# Цель
// Пакет Redux Toolkit предназначен для стандартного способа написания логики Redux. Первоначально он был создан, чтобы помочь решить три распространенные проблемы, связанные с Redux:

/*
- "Настройка хранилища Redux слишком сложна"
- "Мне нужно добавить много пакетов, чтобы Redux мог делать что-нибудь полезное"
- "Redux требует слишком много шаблонного (повторяющегося) кода"
*/

// Мы не можем решить каждый кейс, но в духе "create-react-app" мы можем попытаться предоставить некоторые инструменты для большей абстракции и для обработки наиболее распространенных вариантов использования, а также включить некоторые полезные утилиты, которые позволят упростить код своего приложения.

// Redux Toolkit также включает в себя мощную функцию получения и кэширования данных, которую мы назвали "RTK Query". Он входит в комплект поставки как отдельный набор точек входа. Это необязательный инструмент, но он может устранить необходимость самостоятельно писать логику получения данных.

// Эти инструменты должны быть полезны всем пользователям Redux. Независимо от того, являетесь ли вы новым пользователем Redux, настраивающим свой первый проект, или опытным пользователем, желающим упростить существующее приложение, Redux Toolkit поможет вам улучшить ваш код Redux.

//# Установка
