//# Атрибут type
// С помощью ещё одного атрибута, type, можно задавать различные типы маркеров, вместо обычных арабских цифр: строчные и заглавные латинские буквы или римские цифры. Возможные значения этого атрибута:

//# Пример
<ol type="1">
  <li>Белка</li>
  <li>Лиса</li>
  <li>Ёж</li>
</ol>;

//# Значения
//* type="1"
// Десятичное число (по умолчанию).

//* type="a"
// Буквы латинского алфавита в нижнем регистре.

//* type="A"
// Буквы латинского алфавита в верхнем регистре.

//* type="i"
// Римские цифры в нижнем регистре.

//* type="I"
// Римские цифры в верхнем регистре.
