//# b (ТЕКСТ ДЛЯ ПРИВЛЕЧЕНИЯ ВНИМАНИЯ) (bold: жирный)
/*
- Тег <b> используется для привлечения внимания к части текста без добавления какой-либо важности или изменения тона: например, если мы хотим визуально выделить ключевые слова, названия продуктов в обзорах, вводные части статей.
- <b> — бывший оформительский тег. Сейчас, согласно спецификации HTML, тег <b> должен использоваться лишь как последнее средство, когда нет других более подходящих тегов: например, для выделения важного используется <strong>, для изменения тона <em>.
- По умолчанию браузеры применяют к <b> жирное начертание с помощью font-weight: bold, но если нет веской причины использовать элемент <b>, то CSS-свойство font-weight со значением bold будет более подходящим выбором для изменения жирности текста.
- Тег <b> поддерживает глобальные атрибуты и события.
- Теги <b> и <strong> внешне похожи: оба по умолчанию делают текст жирным. Но нужно понимать, что тег <strong> используется для выделения важного, а тег <b> просто изменяет визуальное оформление.
*/

//# Пример
<p>
  В лидеры обзора вышли
  <b>MDR-V6</b> и <b>ATH-M50x</b>, одни из самых популярных мониторных наушников.
</p>;
