//# Реакция на ввод с состоянием
// React предоставляет декларативный способ управления пользовательским интерфейсом. Вместо прямого управления отдельными частями пользовательского интерфейса вы описываете различные состояния, в которых может находиться ваш компонент, и переключаетесь между ними в ответ на действия пользователя. Это похоже на то, как дизайнеры думают о пользовательском интерфейсе.

/* Вы выучите:
- Чем декларативное программирование пользовательского интерфейса отличается от императивного программирования пользовательского интерфейса
- Как перечислить различные визуальные состояния, в которых может находиться ваш компонент
- Как инициировать изменения между различными визуальными состояниями из кода
*/

//# Сравнение декларативного пользовательского интерфейса с императивным