//# Состояние: память компонента
// Компоненты часто должны изменять то, что отображается на экране в результате взаимодействия. Ввод текста в форму должен обновить поле ввода, нажатие кнопки "next" на карусели изображений должно изменить отображаемое изображение, нажатие кнопки "buy" должно поместить товар в корзину. Компоненты должны "запоминать" вещи: текущее значение ввода, текущее изображение, корзину. В React такая специфическая для компонентов память называется "состояние" (state).

/* Вы узнаете
- Как добавить переменную состояния с помощью хука useState
- Какую пару значений возвращает хук useState.
- Как добавить более одной переменной состояния
- Почему состояние называется локальным
*/

