//# Обновление массивов в состоянии
// В JavaScript массивы являются изменяемыми, но при хранении их в состоянии вы должны относиться к ним как к неизменяемым. Как и в случае с объектами, когда вы хотите обновить массив, хранящийся в состоянии, вам нужно создать новый массив (или сделать копию существующего), а затем установить состояние для использования нового массива.

/* Вы узнаете
- Как добавлять, удалять или изменять элементы в массиве в React state
- Как обновить объект внутри массива
- Как сделать копирование массива менее повторяющимся с помощью Immer
*/