//# article
/*
- Тег <article> обозначает законченный и самодостаточный раздел документа, описывающий какую-то сущность: товар, карточку пользователя, рекламный баннер, виджет.
- Тег <article> семантически «помечает», что его содержимое — это какая-то одна конкретная сущность. Никакого поведенческого или иного оформления это не даёт, визуально выглядит как блочный <div>-элемент.
- <article> или <section>?

*/



//# Пример
<article>
  <h1>
    Тег <code>&lt;article&gt;</code>, и с чем его едят
  </h1>
  <h2>Кратко</h2>
  <p>
    Тег <code>&lt;article&gt;</code> обозначает законченный и самодостаточный раздел документа, описывающий какую-то
    сущность: статью, товар, карточку пользователя и т. д.
  </p>
  <h2>Пример</h2>
  <pre>
    <code>Рекурсия! 💥</code>
  </pre>
</article>;
