//# dt (ТЕРМИН) (description term: термин списка описаний)
/*
- Элемент <dt> используется для вёрстки термина либо ключа в паре «ключ-значение».
- Элемент <dt> используется для вёрстки термина либо ключа в паре «ключ-значение». Как правило, следом за ним идёт либо ещё один тег <dt> (если есть необходимость сверстать несколько терминов с одним определением), либо тег <dd>.
*/

//# Пример
//* Классический вариант. Один термин — одно определение
<dl>
  <dt>Blink</dt>
  <dd>Движок в браузерах Chrome, Edge, Opera</dd>
  <dt>Gecko</dt>
  <dd>Движок в браузере Firefox</dd>
  <dt>WebKit</dt>
  <dd>Движок в браузере Apple Safari</dd>
</dl>;
