//# Что такое компиляция?
// Разработчики пишут код на языках, более удобных для разработчиков, таких как JSX, TypeScript и современные версии JavaScript. Хотя эти языки повышают эффективность и уверенность разработчиков, их необходимо скомпилировать в JavaScript, прежде чем браузеры смогут их понять.

// Компиляция — это процесс взятия кода на одном языке и вывода его на другом языке или другой версии этого языка.

// В Next.js компиляция происходит на этапе разработки, когда вы редактируете код, а также на этапе сборки для подготовки приложения к производству.
