//# Что такое минификация?
// Разработчики пишут код, оптимизированный для удобства чтения человеком. Этот код может содержать дополнительную информацию, которая не требуется для запуска кода, например комментарии, пробелы, отступы и несколько строк.

// Минификация — это процесс удаления ненужного форматирования кода и комментариев без изменения функциональности кода. Цель — повысить производительность приложения за счет уменьшения размера файлов.

// В Next.js файлы JavaScript и CSS автоматически минимизируются для рабочей среды.
