//# Время сборки и время выполнения
// Время сборки (или шаг сборки) — это название серии шагов, которые подготавливают код вашего приложения к производству.

/*
Когда вы создаете приложение, Next.js преобразует ваш код в оптимизированные для производства файлы, готовые к развертыванию на серверах и использованию пользователями. Эти файлы включают в себя:

- HTML-файлы для статически генерируемых страниц.
- Код JavaScript для рендеринга страниц на сервере
- Код JavaScript для интерактивности страниц на клиенте
- CSS-файлы
*/

// Время выполнения (или время запроса) — это период времени, в течение которого ваше приложение запускается в ответ на запрос пользователя после того, как ваше приложение было создано и развернуто.

// Далее давайте обсудим некоторые термины, представленные в этом разделе, такие как клиент, сервер и рендеринг.
