//# Состояние: память компонента
// Компонентам часто необходимо изменить то, что отображается на экране в результате взаимодействия. Ввод в форму должен обновить поле ввода, нажатие «Далее» на карусели изображений должно изменить отображаемое изображение, нажатие «купить» должно поместить продукт в корзину. Компоненты должны «запоминать» вещи: текущее входное значение, текущее изображение, корзину. В React такой тип памяти для конкретного компонента называется состоянием.

/* Вы выучите:
- Как добавить переменную состояния с помощью хука useState
- Какую пару значений возвращает хук useState
- Как добавить более одной переменной состояния
- Почему состояние называется локальным
*/


