//# 02. Туториал. Крестики-нолики
// В ходе этого урока вы создадите небольшую игру в крестики-нолики. Этот учебник не предполагает каких-либо существующих знаний React. Методы, которые вы изучите в этом руководстве, являются основополагающими для создания любого приложения React, и их полное понимание даст вам глубокое понимание React.

// Этот учебник предназначен для людей, которые предпочитают учиться на практике и хотят быстро попробовать сделать что-то осязаемое. Если вы предпочитаете изучать каждую концепцию шаг за шагом, начните с описания UI.