//# Создание списков
// Часто вам потребуется отобразить несколько похожих компонентов из набора данных. Вы можете использовать методы массива JavaScript для управления массивом данных. На этой странице вы будете использовать filter() и map() с React для фильтрации и преобразования вашего массива данных в массив компонентов.

/* Вы выучите:
- Как отрендерить компоненты из массива с помощью JavaScript map()
- Как отрендерить только определенные компоненты с помощью JavaScript filter()
- Когда и зачем использовать ключи React
*/

